def greet_teacher(name,subject):
    greeting = f"Шановна {name},\n\n" \
               f"Від імені стументів висловляємо Вам нашу щиру вдячність за працю та натхненн." \
               f"Ваші знання з предмету {subject} надихають нас на нові досягнення та розвиток." \
               f"Дякуємо за вашу терпеливість,підтримку та готовність ділитися досвідом." \
               f"З найкращими побажаннями,\nВаші студенти."
    return greeting

teacher_name = "Палій Іванна Іванівна"
subject = "Програмування Python"
print(greet_teacher(teacher_name,subject))
